mikaelpatel/Cosa/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2013-2014, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
# 
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
# 
# @section Description
# The Cosa Arduino core boards definition file; in alfabetical order. 
# 
# This file is part of the Arduino Che Cosa project.

##
# ANARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
miniwireless.name=Cosa Anarduino MiniWireless (ATmega328/Optiboot)
miniwireless.upload.tool=avrdude
miniwireless.upload.protocol=arduino
miniwireless.upload.maximum_size=32256
miniwireless.upload.maximum_data_size=2048
miniwireless.upload.speed=115200

miniwireless.bootloader.tool=avrdude
miniwireless.bootloader.low_fuses=0xff
miniwireless.bootloader.high_fuses=0xde
miniwireless.bootloader.extended_fuses=0x05

miniwireless.build.mcu=atmega328p
miniwireless.build.f_cpu=16000000L
miniwireless.build.board=ANARDUINO_MINIWIRELESS
miniwireless.build.variant=anarduino/miniwireless
miniwireless.build.core=cosa

##
# ARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
duemilanove.name=Cosa Arduino Duemilanove (ATmega328/BOOT_168)
duemilanove.upload.tool=avrdude
duemilanove.upload.protocol=arduino
duemilanove.upload.maximum_size=30720
duemilanove.upload.maximum_data_size=2048
duemilanove.upload.speed=57600

duemilanove.bootloader.tool=avrdude
duemilanove.bootloader.low_fuses=0xff
duemilanove.bootloader.high_fuses=0xda
duemilanove.bootloader.extended_fuses=0x05

duemilanove.build.mcu=atmega328p
duemilanove.build.f_cpu=16000000L
duemilanove.build.board=ARDUINO_DUEMILANOVE
duemilanove.build.variant=arduino/duemilanove
duemilanove.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
leonardo.name=Cosa Arduino Leonardo (ATmega32U4/Caterina)
leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=ARDUINO_LEONARDO
leonardo.build.variant=arduino/leonardo
leonardo.build.extra_flags={build.usb_flags}
leonardo.build.core=cosa

# AVR:ATmega2560
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
mega.name=Cosa Arduino Mega (ATmega2560/STK500v2)
mega.upload.tool=avrdude
mega.upload.protocol=wiring
mega.upload.maximum_size=258048
mega.upload.maximum_data_size=8192
mega.upload.speed=115200

mega.bootloader.tool=avrdude
mega.bootloader.low_fuses=0xff
mega.bootloader.high_fuses=0xd8
mega.bootloader.extended_fuses=0xfd

mega.build.mcu=atmega2560
mega.build.f_cpu=16000000L
mega.build.board=ARDUINO_MEGA2560
mega.build.variant=arduino/mega
mega.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
nano.name=Cosa Arduino Nano (ATmega328/BOOT_168)
nano.upload.tool=avrdude
nano.upload.protocol=arduino
nano.upload.maximum_size=30720
nano.upload.maximum_data_size=2048
nano.upload.speed=57600

nano.bootloader.tool=avrdude
nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xda
nano.bootloader.extended_fuses=0x05

nano.build.mcu=atmega328p
nano.build.f_cpu=16000000L
nano.build.board=ARDUINO_NANO
nano.build.variant=arduino/nano
nano.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
pro-micro.name=Cosa Arduino Pro Micro (ATmega32U4/Caterina)
pro-micro.upload.tool=avrdude
pro-micro.upload.protocol=avr109
pro-micro.upload.maximum_size=28672
pro-micro.upload.maximum_data_size=2560
pro-micro.upload.speed=57600
pro-micro.upload.disable_flushing=true
pro-micro.upload.use_1200bps_touch=true
pro-micro.upload.wait_for_upload_port=true

pro-micro.bootloader.tool=avrdude
pro-micro.bootloader.low_fuses=0xff
pro-micro.bootloader.high_fuses=0xd8
pro-micro.bootloader.extended_fuses=0xcb

pro-micro.build.mcu=atmega32u4
pro-micro.build.f_cpu=16000000L
pro-micro.build.vid=0x2341
pro-micro.build.pid=0x8037
pro-micro.build.usb_product="Arduino Pro Micro"
pro-micro.build.board=ARDUINO_PRO_MICRO
pro-micro.build.variant=arduino/pro-micro
pro-micro.build.extra_flags={build.usb_flags}
pro-micro.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
pro-mini.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168)
pro-mini.upload.tool=avrdude
pro-mini.upload.protocol=arduino
pro-mini.upload.maximum_size=30720
pro-mini.upload.maximum_data_size=2048
pro-mini.upload.speed=57600

